{
  "Welcome to React": "大家好，歡迎來到我的網站",
  "About": {
    "title": "關於",
    "p": {
      "1": "歡迎來到我的網站！",
      "2": "大家好！敝姓黃，名奕恩，英Ian，號IONIS。目前是美國布蘭戴斯（Brandeis）大學的學生，今年大三，正讀神經學及資訊工程。出生於台灣台南，八年級時跟家人搬遷美國。我從小就對科技很熱誠，我爸也很喜歡組裝電腦，所以從小就跟他學了很多。因此，我也學會如何灌系統，自己也開始探索其他科技，比如iOS越獄。八年級暑假接觸了我的第一個程式語言：Java。之後，因為想秀給其他人看我做的一些程式，而學了HTML、CSS、Typescript、NodeJS等。這網站也呈現了這些年來我做的一些程式作品。",
      "3": "今天，我大部分的寫程式經驗都是關於網路開發，不管是前端或後端，但我希望以後能學習更多不同的電腦領域比如說人工智能。我也希望能帶一些我在神經學學的知識到程式方面，或反之，帶一些寫程式的技能到神經學研究上。我大二時也修了一門叫計算神經科學的課。那堂課裡我們用數學模型跟MATLAB來模擬神經跟神經系統。",
      "4": "更多中文翻譯還在更新中！",
      "5": "聯絡方式"
    }
  },
  "Projects": {
    "title": "作品",
    "used-tech": "使用的語言及函式庫",
    "mathcal": {
      "title": "數學行事曆",
      "year": "2016",
      "p": "一個用數學函式來代表日期的好玩行事曆。這是我第一個在高中做的html網站。這個點子是從我高中數學老師來的。當時，他用根號10（3.1623）來代替3月16號。回家後我開始思考怎麼找到其他日期及函數。一開始我是先用Java寫出演算法，之後因為有著想要分享給人家的動機，而學了HTML、CSS跟Javascript並做成網站。更多更新跟演算法將來臨！"
    },
    "socshoot": {
      "title": "足球射擊",
      "year": "2017 - 2021",
      "p": "一個線上多人遊戲，玩家用射擊足球的方式來「踢」足球。這是我第一次做電腦遊戲，而且也是我第一次做多人線上遊戲。我使用了Playcanvas當作遊戲引擎，因為它使用WebGL且可以多人線上編輯。因為這是多人遊戲，所以我還必須在後端用cannon.js跑模擬物理伺服器，並且用Socket.io來連接前端跟後端。這個遊戲也教了我多人遊戲如何運作。今天版本Alpha 3.3已上線（可以點擊上面網址拜訪）。敬請其他更多更新！"
    },
    "raspTV": {
      "title": "RaspTV",
      "year": "2020",
      "p": "我的外公外婆住在美國，他們希望能夠看到台灣電視，但可惜的是他們不知道怎麼在網路上搜尋電視直播。所以我做了一個網路程式讓他們可以用手機來遙控在Raspberry Pi上播放著台灣新聞直播的網路程式。"
    },
    "bang": {
      "title": "Bang! with Friends",
      "year": "2020 8月 - 現今",
      "p": "這是個網路版的「砰！Bang!」桌遊。這是我跟我朋友都蠻喜歡玩的桌遊，但因為疫情導致我們無法聚集玩，網路上也沒有很好的網路版，所以我們就打算做一個介面更乾淨、用最新函式庫做的網路版「砰！」。目前還在開發中。這也是我第一次使用Pixi.js。"
    },
    "hack": {
      "title": "黑客松作品",
      "hackmap": {
        "title": "Hackm.app",
        "year": "2018 11月",
        "p": "Hackm.app shows MLH hackathons on an interactive U.S. map. The interactive map is made using D3, and when click on a location, it opens the hackathon website in an iframe. The backend uses Python and BeautifulSoup to scrape MLH websites for hackathon information. This project was awarded Best Web/Mobile App in Codestellation 2018."
      },
      "wikiwhere": {
        "title": "Wikiwhere",
        "year": "2019 11月",
        "p": "Wikiwhere visualizes the hyperlink connections between two Wikipedia articles. The backend uses bi-directional breadth first search to find the shortest path of two articles from queried Wikipedia data dump. The frontend uses D3 to visualize the graph. This project was awarded Judge’s Pick in Codestellation 2019."
      }
    }
  },
  "Experience": {
    "title": "經驗",
    "rocket": {
      "title": "Rocket Software",
      "location": "Waltham, MA",
      "year": "2019 6月 - 2019 12月",
      "position": "軟體工程實習生",
      "p": {
        "1": "Built a web app on Zowe, an open-source mainframe framework, using Deck.gl and React which visualizes objects in a db2 database by showing their hierarchical relationships.",
        "2": "Submitted pull requests to Uber’s Vis Academy for fixing tutorials on Deck.gl.",
        "3": "Created features on Newton App on Zowe using Yeoman, GraphQL, and React Hooks and Context."
      }
    },
    "fcc": {
      "title": "Fellowship of Christian Clubs",
      "location": "線上",
      "year": "2019 7月 - 現今",
      "position": "軟體工程師",
      "p": {
        "1": "Designed and built a student portal using React and Material-UI",
        "2": "Modeled and maintained backend-server and database"
      },
      "source-code": "Source code is private"
    },
    "gravyty": {
      "title": "Gravyty",
      "location": "Newton, MA",
      "year": "2017 8月",
      "position": "軟體工程實習生",
      "p": {
        "1": "Improved front-end website designs and user interfaces",
        "2": "Developed algorithms on the back-end server using Python"
      }
    },
    "awards": {
      "title": "得獎",
      "code19": {
        "title": "Codestellation 2019",
        "location": "Waltham, MA",
        "year": "2019 11月",
        "award-title": "最佳評審獎",
        "p": "Created wikiwhere using D3, a web app that visualizes Wikipedia links connections. More descriptions in above Projects page."
      },
      "code18": {
        "title": "Codestellation 2018",
        "location": "Waltham, MA",
        "year": "2018 11月",
        "award-title": "最佳網路/行動應用程式獎",
        "p": "Created Hackm.app using D3, a web app that displays hackathons across the United States. More descriptions in Projects page."
      }
    },
    "skills": {
      "title": "技能",
      "web": {
        "title": "網路應用框架",
        "frontend": "前端",
        "backend": "後端"
      },
      "lang": "語言",
      "others": "其他"
    }
  },
  "Language": {
    "title": "English",
    "English": "英文",
    "Mandarin": "中文",
    "Taiwanese": "台語"
  }
}